tap "argoproj/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "minamijoyo/hcledit"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "weaveworks/tap"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argo"
brew "argocd"
brew "python@3.11"
brew "awscli"
brew "binutils"
brew "python@3.12"
brew "cheat"
brew "checkbashisms"
brew "clang-format"
brew "cryptography"
brew "exiftool"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "libarchive"
brew "libmicrohttpd"
brew "librist"
brew "openblas"
brew "openvino"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "glances"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "helm"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "mackup"
brew "minikube"
brew "mitmproxy"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "nnn"
brew "pandoc"
brew "pgformatter"
brew "powerlevel10k"
brew "pre-commit"
brew "prettier"
brew "scrcpy"
brew "sdcv"
brew "shellcheck"
brew "sqlc"
brew "terraform-docs"
brew "tldr", link: false
brew "tlrc"
brew "tree"
brew "vegeta"
brew "vhs"
brew "watch"
brew "wireguard-tools"
brew "yamllint"
brew "zoxide"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "hashicorp/tap/terraform"
brew "minamijoyo/hcledit/hcledit"
brew "oven-sh/bun/bun"
brew "weaveworks/tap/eksctl"
cask "1password-cli"
cask "anaconda"
cask "android-platform-tools"
cask "background-music"
cask "clipy"
cask "devtoys"
cask "fig"
cask "ngrok"
cask "orbstack"
cask "psst"
cask "sioyek"
cask "switchkey"
cask "trunk-io"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anseki.vscode-color"
vscode "bbenoist.nix"
vscode "bierner.color-info"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "ckolkman.vscode-postgres"
vscode "codesandbox-io.codesandbox-projects"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "dksedgwick.xstviz"
vscode "donjayamanne.githistory"
vscode "dorzey.vscode-sqlfluff"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "kimuson.ts-type-expand"
vscode "lihui.vs-color-picker"
vscode "mariusalchimavicius.json-to-ts"
vscode "matt-meyers.vscode-dbml"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "pmneo.tsimporter"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "pustelto.bracketeer"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "simonsiefke.svg-preview"
vscode "statelyai.stately-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "trunk.io"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
