tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Run your GitHub Actions locally
brew "act"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU binary tools for native development
brew "binutils"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Alternative to top/htop
brew "glances"
# Kubernetes package manager (Helm CLI - if needed outside nix)
brew "node"
# CLI for Heroku
brew "heroku"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Run a Kubernetes cluster locally
brew "minikube"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr", link: false
# Official tldr client written in Rust
brew "tlrc"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
brew "tor"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar manager
cask "jordanbaird-ice"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Replacement for Docker Desktop
cask "orbstack"
cask "alt-tab"
cask "chatgpt"
cask "claude"
cask "grammarly-desktop"
cask "hammerspoon"
cask "heptabase"
cask "nordvpn"
cask "postico"
cask "proxyman"
cask 'raycast', args: { require_sha: false }  # Spotlight alternative
cask "skim"
cask "spotify"
cask "thunderbird"
cask "whatsapp"
cask "zoom"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
# System monitor for the menu bar
cask "stats"
cask "google-chrome"
cask "wireshark"
cask "postman"
cask "cursor"
cask "shottr"
# Menu bar pomodoro timer
cask "tomatobar"
# Open-source code editor
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anseki.vscode-color"
vscode "bbenoist.nix"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "ckolkman.vscode-postgres"
vscode "clarkyu.vscode-sql-beautify"
vscode "codesandbox-io.codesandbox-projects"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-postgresql-client2"
vscode "dbaeumer.vscode-eslint"
vscode "dksedgwick.xstviz"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dorzey.vscode-sqlfluff"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "kimuson.ts-type-expand"
vscode "lihui.vs-color-picker"
vscode "mariusalchimavicius.json-to-ts"
vscode "matt-meyers.vscode-dbml"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "pmneo.tsimporter"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "pustelto.bracketeer"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "simonsiefke.svg-preview"
vscode "statelyai.stately-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "trunk.io"
vscode "tyriar.sort-lines"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wix.vscode-import-cost"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
